MikroElektronika/core_packages/PIC/XC8/def/PIC12LF1571/mcu.h
extern volatile PWM3OFCONbits_t PWM3OFCONbits __at(0xDC0);
// bitfield macros
#define _PWM3OFCON_OFS_POSN                                 0x0
#define _PWM3OFCON_OFS_POSITION                             0x0
#define _PWM3OFCON_OFS_SIZE                                 0x2
#define _PWM3OFCON_OFS_LENGTH                               0x2
#define _PWM3OFCON_OFS_MASK                                 0x3
#define _PWM3OFCON_OFO_POSN                                 0x4
#define _PWM3OFCON_OFO_POSITION                             0x4
#define _PWM3OFCON_OFO_SIZE                                 0x1
#define _PWM3OFCON_OFO_LENGTH                               0x1
#define _PWM3OFCON_OFO_MASK                                 0x10
#define _PWM3OFCON_OFM_POSN                                 0x5
#define _PWM3OFCON_OFM_POSITION                             0x5
#define _PWM3OFCON_OFM_SIZE                                 0x2
#define _PWM3OFCON_OFM_LENGTH                               0x2
#define _PWM3OFCON_OFM_MASK                                 0x60
#define _PWM3OFCON_PWM3OFS0_POSN                            0x0
#define _PWM3OFCON_PWM3OFS0_POSITION                        0x0
#define _PWM3OFCON_PWM3OFS0_SIZE                            0x1
#define _PWM3OFCON_PWM3OFS0_LENGTH                          0x1
#define _PWM3OFCON_PWM3OFS0_MASK                            0x1
#define _PWM3OFCON_PWM3OFS1_POSN                            0x1
#define _PWM3OFCON_PWM3OFS1_POSITION                        0x1
#define _PWM3OFCON_PWM3OFS1_SIZE                            0x1
#define _PWM3OFCON_PWM3OFS1_LENGTH                          0x1
#define _PWM3OFCON_PWM3OFS1_MASK                            0x2
#define _PWM3OFCON_PWM3OFM0_POSN                            0x5
#define _PWM3OFCON_PWM3OFM0_POSITION                        0x5
#define _PWM3OFCON_PWM3OFM0_SIZE                            0x1
#define _PWM3OFCON_PWM3OFM0_LENGTH                          0x1
#define _PWM3OFCON_PWM3OFM0_MASK                            0x20
#define _PWM3OFCON_PWM3OFM1_POSN                            0x6
#define _PWM3OFCON_PWM3OFM1_POSITION                        0x6
#define _PWM3OFCON_PWM3OFM1_SIZE                            0x1
#define _PWM3OFCON_PWM3OFM1_LENGTH                          0x1
#define _PWM3OFCON_PWM3OFM1_MASK                            0x40
#define _PWM3OFCON_PWM3OFS_POSN                             0x0
#define _PWM3OFCON_PWM3OFS_POSITION                         0x0
#define _PWM3OFCON_PWM3OFS_SIZE                             0x2
#define _PWM3OFCON_PWM3OFS_LENGTH                           0x2
#define _PWM3OFCON_PWM3OFS_MASK                             0x3
#define _PWM3OFCON_PWM3OFMC_POSN                            0x4
#define _PWM3OFCON_PWM3OFMC_POSITION                        0x4
#define _PWM3OFCON_PWM3OFMC_SIZE                            0x1
#define _PWM3OFCON_PWM3OFMC_LENGTH                          0x1
#define _PWM3OFCON_PWM3OFMC_MASK                            0x10
#define _PWM3OFCON_PWM3OFM_POSN                             0x5
#define _PWM3OFCON_PWM3OFM_POSITION                         0x5
#define _PWM3OFCON_PWM3OFM_SIZE                             0x2
#define _PWM3OFCON_PWM3OFM_LENGTH                           0x2
#define _PWM3OFCON_PWM3OFM_MASK                             0x60
#define _PWM3OFCON_OFS0_POSN                                0x0
#define _PWM3OFCON_OFS0_POSITION                            0x0
#define _PWM3OFCON_OFS0_SIZE                                0x1
#define _PWM3OFCON_OFS0_LENGTH                              0x1
#define _PWM3OFCON_OFS0_MASK                                0x1
#define _PWM3OFCON_OFS1_POSN                                0x1
#define _PWM3OFCON_OFS1_POSITION                            0x1
#define _PWM3OFCON_OFS1_SIZE                                0x1
#define _PWM3OFCON_OFS1_LENGTH                              0x1
#define _PWM3OFCON_OFS1_MASK                                0x2
#define _PWM3OFCON_OFM0_POSN                                0x5
#define _PWM3OFCON_OFM0_POSITION                            0x5
#define _PWM3OFCON_OFM0_SIZE                                0x1
#define _PWM3OFCON_OFM0_LENGTH                              0x1
#define _PWM3OFCON_OFM0_MASK                                0x20
#define _PWM3OFCON_OFM1_POSN                                0x6
#define _PWM3OFCON_OFM1_POSITION                            0x6
#define _PWM3OFCON_OFM1_SIZE                                0x1
#define _PWM3OFCON_OFM1_LENGTH                              0x1
#define _PWM3OFCON_OFM1_MASK                                0x40

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
extern volatile unsigned char           STATUS_SHAD         __at(0xFE4);
#ifndef _LIB_BUILD
asm("STATUS_SHAD equ 0FE4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C_SHAD                 :1;
        unsigned DC_SHAD                :1;
        unsigned Z_SHAD                 :1;
    };
} STATUS_SHADbits_t;
extern volatile STATUS_SHADbits_t STATUS_SHADbits __at(0xFE4);
// bitfield macros
#define _STATUS_SHAD_C_SHAD_POSN                            0x0
#define _STATUS_SHAD_C_SHAD_POSITION                        0x0
#define _STATUS_SHAD_C_SHAD_SIZE                            0x1
#define _STATUS_SHAD_C_SHAD_LENGTH                          0x1
#define _STATUS_SHAD_C_SHAD_MASK                            0x1
#define _STATUS_SHAD_DC_SHAD_POSN                           0x1
#define _STATUS_SHAD_DC_SHAD_POSITION                       0x1
#define _STATUS_SHAD_DC_SHAD_SIZE                           0x1
#define _STATUS_SHAD_DC_SHAD_LENGTH                         0x1
#define _STATUS_SHAD_DC_SHAD_MASK                           0x2
#define _STATUS_SHAD_Z_SHAD_POSN                            0x2
#define _STATUS_SHAD_Z_SHAD_POSITION                        0x2
#define _STATUS_SHAD_Z_SHAD_SIZE                            0x1
#define _STATUS_SHAD_Z_SHAD_LENGTH                          0x1
#define _STATUS_SHAD_Z_SHAD_MASK                            0x4

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
extern volatile unsigned char           WREG_SHAD           __at(0xFE5);
#ifndef _LIB_BUILD
asm("WREG_SHAD equ 0FE5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WREG_SHAD              :8;
    };
} WREG_SHADbits_t;
